const puzzles = {
    1: {
        gridSize: 7,
        circles: [
            {x: 0.5, y: 1, cells: [  // 左下方的星系
                {x: 0, y: 0}, {x: 0, y: 1}
            ]},
            {x: 0.5, y: 4, cells: [  // 左侧中部的星系
                {x: 0, y: 3}, {x: 0, y: 4}
            ]},
            {x: 1, y: 2.5, cells: [  // 左侧偏下的星系
                {x: 0, y: 2}, {x: 1, y: 2}
            ]},
            {x: 1, y: 6.5, cells: [  // 左上方的星系
                {x: 0, y: 6}, {x: 1, y: 6}
            ]},
            {x: 2.5, y: 0.5, cells: [  // 底部中间的星系
                {x: 1, y: 0}, {x: 2, y:0}, {x: 3, y: 0}
            ]},
            {x: 2.5, y: 4.5, cells: [  // 中部偏上的星系
                {x: 2, y:4}
            ]},
            {x: 3, y: 3, cells: [  // 中心大星系
                {x: 0, y: 5}, {x: 1, y: 1}, {x: 1, y: 3}, {x: 1, y: 4}, {x: 1, y: 5}, {x: 2, y: 1}, {x: 2, y: 2}, {x: 2, y: 3}
                , {x: 3, y: 2}, {x: 3, y: 3}, {x: 3, y:4}, {x: 4, y: 0}, {x: 4, y: 1}, {x: 4, y: 2}, {x: 4, y: 4}, {x: 5, y:0}
            ]},
            {x: 3.5, y: 1.5, cells: [  // 中部偏右下的星系
                {x: 3, y: 1}
            ]},
            {x: 4.5, y: 3.5, cells: [  // 中部偏右的星系
                {x: 4, y:3}
            ]},
            {x: 4, y: 6, cells: [  // 右上方的大星系
                {x: 2, y: 5}, {x: 2, y: 6}, {x: 3, y: 5}, {x: 3, y: 6}, {x: 4, y: 5}, {x:4, y: 6}, {x: 5, y: 5}, {x: 5, y: 6}
            ]},
            {x: 5.5, y: 3, cells: [  // 右侧中部的星系
                {x: 5, y: 1}, {x: 5, y: 2}, {x: 5, y: 3}, {x: 5, y: 4}
            ]},
            {x: 6.5, y: 3.5, cells: [  // 最右侧的长条星系
                {x: 6, y: 0}, {x: 6, y: 1}, {x: 6, y: 2},{x: 6, y: 3}, {x: 6, y: 4}, {x: 6, y: 5}, {x: 6, y: 6}
            ]}
        ]
    },
    2: {
        gridSize: 7,
        circles: [
            {x: 0.5, y: 1, cells: [  // 左下方的星系
                {x: 0, y: 0}, {x: 0, y: 1}
            ]},
            {x: 0.5, y: 4, cells: [  // 左侧中部的星系
                {x: 0, y: 3}, {x: 0, y: 4}
            ]},
            {x: 1, y: 2.5, cells: [  // 左侧偏下的星系
                {x: 0, y: 2}, {x: 1, y: 2}
            ]},
            {x: 1, y: 6.5, cells: [  // 左上方的星系
                {x: 0, y: 6}, {x: 1, y: 6}
            ]},
            {x: 2.5, y: 0.5, cells: [  // 底部中间的星系
                {x: 1, y: 0}, {x: 2, y:0}, {x: 3, y: 0}
            ]},
            {x: 2.5, y: 4.5, cells: [  // 中部偏上的星系
                {x: 2, y:4}
            ]},
            {x: 3, y: 3, cells: [  // 中心大星系
                {x: 0, y: 5}, {x: 1, y: 1}, {x: 1, y: 3}, {x: 1, y: 4}, {x: 1, y: 5}, {x: 2, y: 1}, {x: 2, y: 2}, {x: 2, y: 3}
                , {x: 3, y: 2}, {x: 3, y: 3}, {x: 3, y:4}, {x: 4, y: 0}, {x: 4, y: 1}, {x: 4, y: 2}, {x: 4, y: 4}, {x: 5, y:0}
            ]},
            {x: 3.5, y: 1.5, cells: [  // 中部偏右下的星系
                {x: 3, y: 1}
            ]},
            {x: 4.5, y: 3.5, cells: [  // 中部偏右的星系
                {x: 4, y:3}
            ]},
            {x: 4, y: 6, cells: [  // 右上方的大星系
                {x: 2, y: 5}, {x: 2, y: 6}, {x: 3, y: 5}, {x: 3, y: 6}, {x: 4, y: 5}, {x:4, y: 6}, {x: 5, y: 5}, {x: 5, y: 6}
            ]},
            {x: 5.5, y: 3, cells: [  // 右侧中部的星系
                {x: 5, y: 1}, {x: 5, y: 2}, {x: 5, y: 3}, {x: 5, y: 4}
            ]},
            {x: 6.5, y: 3.5, cells: [  // 最右侧的长条星系
                {x: 6, y: 0}, {x: 6, y: 1}, {x: 6, y: 2},{x: 6, y: 3}, {x: 6, y: 4}, {x: 6, y: 5}, {x: 6, y: 6}
            ]}
        ]
    },
};

module.exports = puzzles; 